/**
 * @file PlayerConst.h
 * @brief Class that holds constants for the player actor.
 */

#pragma once

#include "../../al/byaml/ByamlIter.h"

class PlayerConst
{
public:
	PlayerConst();
	PlayerConst(al::ByamlIter const &);

	virtual f32 getGravity() const;
	virtual f32 getFrictionAttack() const;
	virtual f32 getPushPower() const;
	virtual f32 getWaitPoseDegreeMax() const;
	virtual f32 getHillPoseDegreeMax() const;
	virtual f32 getTiltPoseDegreeMax() const;
	virtual f32 getSlerpQuatRate() const;
	virtual f32 getSlerpQuatRateWait() const;
	virtual f32 getSlerpQuatGrav() const;
	virtual s32 getPreInputFrameCapThrow() const;
	virtual s32 getEnableActionFrameCapCatch() const;
	virtual f32 getJumpPowerCapCatch() const;
	virtual f32 getJumpGravityCapCatch() const;
	virtual s32 getRunTimeContinuousThrow() const;
	virtual f32 getRunSpeedMaxContinuousThrow() const;
	virtual s32 getRunAccelFrameContinuousThrow() const;
	virtual f32 getSeparateCheckHeight() const;
	virtual f32 getSeparateOffsetLerpRate() const;
	virtual f32 getSeparateEnableThrowHeight() const;
	virtual f32 getTall() const;
	virtual f32 getCollisionRadius() const;
	virtual f32 getCollisionRadiusSquat() const;
	virtual f32 getCollisionRadiusStand() const;
	virtual f32 getCollisionSmallStepHeight() const;
	virtual f32 getCollisionResetLimit() const;
	virtual f32 getCollisionResetLimitHigh() const;
	virtual f32 getReflectCeilingPower() const;
	virtual f32 getReflectTossPower() const;
	virtual f32 getReflectUpperPunchScaleH() const;
	virtual f32 getCollisionHitDownAngleH() const;
	virtual f32 getCollisionHitDownEscapeAngleV() const;
	virtual f32 getShadowDropHeightScale() const;
	virtual f32 getShadowDropNormalAdd() const;
	virtual f32 getShadowDropLengthMin() const;
	virtual f32 getShadowDropLengthMax() const;
	virtual f32 getShadowDropLengthExtend() const;
	virtual f32 getGravityDamage() const;
	virtual f32 getHopPowerDamage() const;
	virtual f32 getPushPowerDamage() const;
	virtual s32 getDamageCancelFrame() const;
	virtual s32 getDamageInvalidCount() const;
	virtual s32 getDamageInvalidCountRecovery() const;
	virtual s32 getDamageInvalidCountAbyss() const;
	virtual f32 getNormalMinSpeed2D() const;
	virtual f32 getNormalMaxSpeed2D() const;
	virtual f32 getDashMaxSpeed2D() const;
	virtual s32 getNormalAccelFrame2D() const;
	virtual s32 getDashAccelFrame2D() const;
	virtual s32 getNormalDashAnimFrame2D() const;
	virtual s32 getNormalBrakeFrame2D() const;
	virtual s32 getStickOnBrakeFrame2D() const;
	virtual s32 getBrakeTurnStartFrame2D() const;
	virtual f32 getTurnEndSpeedRate2D() const;
	virtual f32 getJumpPowerMin2DArea() const;
	virtual f32 getJumpPowerMax2DArea() const;
	virtual f32 getJumpPowerMinBorder2D() const;
	virtual f32 getJumpPowerMaxBorder2D() const;
	virtual f32 getGravityMove() const;
	virtual f32 getNormalMaxSpeed() const;
	virtual f32 getNormalMinSpeed() const;
	virtual s32 getNormalAccelFrame() const;
	virtual f32 getRunAccelAverageScale() const;
	virtual s32 getNormalBrakeFrame() const;
	virtual f32 getDashJudgeSpeed() const;
	virtual s32 getStickOnBrakeFrame() const;
	virtual s32 getNormalDashAnimFrame() const;
	virtual f32 getRunAfterTurnSpeedMax() const;
	virtual f32 getRunAfterTurnScale() const;
	virtual s32 getRunAfterTurnFrame() const;
	virtual s32 getBrakeTurnStartFrame() const;
	virtual f32 getBrakeOnSpeedRate() const;
	virtual s32 getBrakeOnCounterBorder() const;
	virtual s32 getWallPushFrame() const;
	virtual s32 getRunDeepDownFrame() const;
	virtual s32 getRunDeepDownMargine() const;
	virtual s32 getQuickTurnJumpFrame() const;
	virtual s32 getRoundAccelFrame() const;
	virtual s32 getRoundBrakeFrame() const;
	virtual f32 getRoundFastDegree() const;
	virtual s32 getRoundAccelFrameFast() const;
	virtual f32 getRoundMinDegree() const;
	virtual s32 getRoundBrakeFrameForce() const;
	virtual f32 getRoundFastDegreeForce() const;
	virtual f32 getRoundLimitDegreeForce() const;
	virtual f32 getRoundLimitDegreeForceFast() const;
	virtual s32 getRoundAccelFrameForceFast() const;
	virtual f32 getRoundLimitDegreeMin() const;
	virtual f32 getRoundLimitDegree() const;
	virtual s32 getIceAccelFrame() const;
	virtual s32 getIceBrakeFrame() const;
	virtual s32 getIceBrakeFrameHigh() const;
	virtual s32 getIceBrakeFrameWall() const;
	virtual s32 getIceRoundAccelFrame() const;
	virtual s32 getIceRoundAccelFrameFast() const;
	virtual s32 getIceRoundBrakeFrame() const;
	virtual f32 getIceRoundFastDegree() const;
	virtual f32 getIceRoundMinDegree() const;
	virtual f32 getIceRoundLimitDegree() const;
	virtual f32 getHillAddSpeed() const;
	virtual f32 getHillSubSpeed() const;
	virtual s32 getHillAccelAddFrame() const;
	virtual s32 getHillAccelSubFrame() const;
	virtual f32 getHillAccelSubAngleMin() const;
	virtual f32 getHillAccelSubAngleMax() const;
	virtual f32 getStandAngleMin() const;
	virtual f32 getStandAngleMax() const;
	virtual f32 getHillAngleSpeedMin() const;
	virtual f32 getHillAngleSpeedMax() const;
	virtual s32 getSpinCapThrowFrame() const;
	virtual s32 getSpinCapThrowFrameAir() const;
	virtual s32 getSpinCapThrowFrameSwim() const;
	virtual s32 getSpinCapThrowFrameSwing() const;
	virtual s32 getSpinCapThrowFrameContinuous() const;
	virtual s32 getSpinAttackFrame() const;
	virtual s32 getSpinBrakeFrame() const;
	virtual f32 getSpinAirJumpPower() const;
	virtual f32 getSpinAirSpeedMax() const;
	virtual f32 getGravitySpinAir() const;
	virtual f32 getSlerpQuatRateSpinAir() const;
	virtual f32 getSpinBrakeRate() const;
	virtual f32 getSpinBrakeSideAccel() const;
	virtual f32 getSpinBrakeSideBrakeRate() const;
	virtual f32 getSpinBrakeSideMaxSpeedRate() const;
	virtual f32 getSpinRoundLimitDegree() const;
	virtual f32 getDamageFireJumpPower1st() const;
	virtual f32 getDamageFireJumpPower2nd() const;
	virtual f32 getDamageFireJumpMoveSpeed() const;
	virtual f32 getDamageFireCeilHitSpeed() const;
	virtual f32 getDamageFireGravity() const;
	virtual s32 getDamageFireNoGravityFrame() const;
	virtual s32 getDamageFireRunTime() const;
	virtual f32 getDamageFireRunSpeed() const;
	virtual f32 getDamageFireRunBrakeFrame() const;
	virtual s32 getSandSinkDeadTime() const;
	virtual s32 getSandSinkBrakeHeightH() const;
	virtual s32 getSandSinkBrakeHeightV() const;
	virtual f32 getSandSinkHeight() const;
	virtual f32 getSandSinkCapThrow() const;
	virtual f32 getSandSinkBrakeMinH() const;
	virtual f32 getSandSinkBrakeMaxH() const;
	virtual f32 getSandSinkBrakeMinV() const;
	virtual f32 getSandSinkBrakeMaxV() const;
	virtual f32 getSlopeSlideAngleStart() const;
	virtual f32 getSlopeSlideAngleEnd() const;
	virtual f32 getSlopeSlideAccel() const;
	virtual f32 getSlopeSlideBrake() const;
	virtual f32 getSlopeSlideMaxSpeed() const;
	virtual f32 getSlopeSlideSpeedEnd() const;
	virtual f32 getSlopeSlideSideAccel() const;
	virtual f32 getSlopeSlideSideBrake() const;
	virtual f32 getSlopeSlideSideMaxSpeed() const;
	virtual f32 getSlopeTurnDegree() const;
	virtual s32 getSlideInvalidFrame() const;
	virtual s32 getSlopeForceFrame() const;
	virtual f32 getSlopeSlideForceSideAccel() const;
	virtual f32 getSlopeSlideForceSideBrake() const;
	virtual f32 getSlopeSlideForceSideMaxSpeed() const;
	virtual f32 getSlopeSlideForceTurnDegree() const;
	virtual f32 getSlopeRollingSpeedStart() const;
	virtual f32 getSlopeRollingSpeedBoost() const;
	virtual f32 getSlopeRollingMaxSpeed() const;
	virtual s32 getSlopeRollingFrameMinBoost() const;
	virtual s32 getSlopeRollingFrameMin() const;
	virtual f32 getSlopeRollingStartJumpPower() const;
	virtual f32 getSlopeRollingStartSlideSpeed() const;
	virtual f32 getSlopeRollingAccel() const;
	virtual f32 getSlopeRollingBrake() const;
	virtual f32 getSlopeRollingAgainst() const;
	virtual f32 getSlopeRollingAnglePowerMax() const;
	virtual f32 getSlopeRollingSpeedEnd() const;
	virtual f32 getSlopeRollingSideAccel() const;
	virtual f32 getSlopeRollingSideBrake() const;
	virtual f32 getSlopeRollingSideMaxSpeed() const;
	virtual s32 getSlopeRollingUnRollFrame() const;
	virtual f32 getSlopeRollingEndBrake() const;
	virtual f32 getSlopeRollingEndBrakeEndSpeed() const;
	virtual f32 getSlopeRollingReStartAccel() const;
	virtual f32 getSlopeRollingReStartMaxAdd() const;
	virtual s32 getSlopeRollingReStartInterval() const;
	virtual s32 getSlopeRollingReStartSwing() const;
	virtual s32 getSlopeRollingReStartCharge() const;
	virtual s32 getSlopeRollingReStartForce() const;
	virtual f32 getSlopeRollingAccelOnSkate() const;
	virtual f32 getSlopeRollingSideAccelOnSkate() const;
	virtual f32 getSlopeRollingBrakeOnSkate() const;
	virtual s32 getExtendFrame() const;
	virtual f32 getJumpInertiaRate() const;
	virtual f32 getJumpPowerMin() const;
	virtual f32 getJumpPowerMax() const;
	virtual f32 getJumpGravity() const;
	virtual f32 getJumpBaseSpeedMax() const;
	virtual f32 getJumpMoveSpeedMin() const;
	virtual f32 getJumpMoveSpeedMax() const;
	virtual f32 getJumpAccelFront() const;
	virtual f32 getJumpAccelBack() const;
	virtual f32 getJumpAccelTurn() const;
	virtual f32 getJumpTurnAngleStart() const;
	virtual f32 getJumpTurnAngleLimit() const;
	virtual f32 getJumpTurnAngleFast() const;
	virtual f32 getJumpTurnAngleFastLimit() const;
	virtual s32 getJumpTurnAccelFrame() const;
	virtual s32 getJumpTurnAccelFrameFast() const;
	virtual s32 getJumpTurnBrakeFrame() const;
	virtual f32 getTrampleGravity() const;
	virtual f32 getTrampleJumpPower() const;
	virtual f32 getTrampleHighGravity() const;
	virtual f32 getTrampleHighJumpPower() const;
	virtual f32 getTrampleGravity2D() const;
	virtual f32 getTrampleJumpPower2D() const;
	virtual f32 getTrampleHighGravity2D() const;
	virtual f32 getTrampleHighJumpPower2D() const;
	virtual f32 getTrampleHipDropGravity() const;
	virtual f32 getTrampleHipDropJumpPower() const;
	virtual f32 getTrampleRisingBrakeVelH() const;
	virtual f32 getTrampleJumpCodePower() const;
	virtual f32 getTrampleJumpCodePowerSmall() const;
	virtual f32 getCapLeapFrogJumpGravity() const;
	virtual f32 getCapLeapFrogJumpPower() const;
	virtual f32 getCapLeapFrogJumpPowerAir() const;
	virtual f32 getObjLeapFrogJumpPower() const;
	virtual f32 getObjLeapFrogJumpPowerHigh() const;
	virtual f32 getCapHeadSpringJumpGravity() const;
	virtual f32 getCapHeadSpringJumpPower() const;
	virtual f32 getCapHeadSpringJumpGravityHigh() const;
	virtual f32 getCapHeadSpringJumpPowerHigh() const;
	virtual f32 getCapHeadSpringSpeedMax() const;
	virtual s32 getContinuousJumpPreInputFrame() const;
	virtual s32 getContinuousJumpCount() const;
	virtual s32 getContinuousJumpTimer() const;
	virtual f32 getContinuousJumpPowerMin() const;
	virtual f32 getJumpPowerMax2nd() const;
	virtual f32 getJumpGravity2nd() const;
	virtual f32 getJumpPowerMax3rd() const;
	virtual f32 getJumpGravity3rd() const;
	virtual f32 getSpinFlowerJumpGravity() const;
	virtual f32 getSpinFlowerJumpFallSpeedMax() const;
	virtual f32 getSpinFlowerJumpMovePower() const;
	virtual f32 getSpinFlowerJumpVelMax() const;
	virtual s32 getSpinFlowerJumpStayFrame() const;
	virtual f32 getSpinFlowerJumpStaySpeedMax() const;
	virtual f32 getSpinFlowerJumpNoInputBrake() const;
	virtual f32 getSpinFlowerJumpDownFallInitSpeed() const;
	virtual f32 getSpinFlowerJumpDownFallPower() const;
	virtual f32 getSpinFlowerJumpDownFallSpeedMax() const;
	virtual f32 getJumpGravityForceRun() const;
	virtual f32 getJumpPowerForceRun() const;
	virtual f32 getCapCatchPopPower() const;
	virtual f32 getCapCatchPopGravity() const;
	virtual f32 getSquatJumpGravity() const;
	virtual f32 getSquatJumpPower() const;
	virtual f32 getSquatJumpBackPower() const;
	virtual f32 getSquatJumpMovePowerFront() const;
	virtual f32 getSquatJumpMovePowerSide() const;
	virtual f32 getSquatJumpMoveSpeedMax() const;
	virtual f32 getTurnJumpGravity() const;
	virtual f32 getTurnJumpPower() const;
	virtual f32 getTurnJumpVelH() const;
	virtual f32 getTurnJumpBrake() const;
	virtual f32 getTurnJumpAccel() const;
	virtual f32 getTurnJumpSideAccel() const;
	virtual f32 getLongJumpAccel() const;
	virtual f32 getLongJumpBrake() const;
	virtual f32 getLongJumpSideAccel() const;
	virtual f32 getLongJumpGravity() const;
	virtual f32 getLongJumpJumpPow() const;
	virtual f32 getLongJumpMovePow() const;
	virtual f32 getLongJumpInitSpeed() const;
	virtual f32 getLongJumpSpeed() const;
	virtual f32 getLongJumpSpeedMin() const;
	virtual s32 getContinuousLongJumpCount() const;
	virtual s32 getContinuousLongJumpTimer() const;
	virtual f32 getGravityAir() const;
	virtual f32 getFrictionAir() const;
	virtual f32 getFallSpeedMax() const;
	virtual f32 getLongFallDistance() const;
	virtual f32 getFallWallScaleVelocity() const;
	virtual s32 getDownFallFrameMin() const;
	virtual f32 getGravityWallSlide() const;
	virtual f32 getWallHeightLowLimit() const;
	virtual f32 getWallKeepDegree() const;
	virtual s32 getWallKeepFrame() const;
	virtual f32 getWallJumpGravity() const;
	virtual f32 getWallJumpHSpeed() const;
	virtual f32 getWallJumpPower() const;
	virtual s32 getWallJumpInvalidateInputFrame() const;
	virtual s32 getWallInhibitAfterPunch() const;
	virtual f32 getWallFollowAngleH() const;
	virtual f32 getWallFollowAngleV() const;
	virtual f32 getWallCatchDegree() const;
	virtual f32 getWallCatchHeightEdgeTop() const;
	virtual f32 getWallCatchHeightBottom() const;
	virtual f32 getWallCatchKeepDegree() const;
	virtual f32 getWallCatchMoveDegree() const;
	virtual f32 getWallCatchMoveSpeed() const;
	virtual f32 getWallCatchMoveHeightRange() const;
	virtual s32 getWallCatchMoveInterpolate() const;
	virtual s32 getWallCatchMoveFrame() const;
	virtual s32 getWallCatchMoveFrameFast() const;
	virtual s32 getWallCatchMoveFrameSwing() const;
	virtual f32 getWallCatchInputRepeatAngle() const;
	virtual f32 getWallClimbDegree() const;
	virtual s32 getWallClimbJumpStartFrame() const;
	virtual s32 getWallClimbJumpEndFrame() const;
	virtual s32 getWallClimbStartFrame() const;
	virtual f32 getWallClimbGravity() const;
	virtual f32 getWallFallJumpSpeed() const;
	virtual f32 getWallClimbJumpSpeedV() const;
	virtual f32 getWallClimbJumpSpeedH() const;
	virtual f32 getWallClimbJumpGravity() const;
	virtual s32 getWallClimbJumpInvalidFrame() const;
	virtual f32 getWallCatchHipLocalOffset() const;
	virtual f32 getWallCatchHipStability() const;
	virtual f32 getWallCatchHipFriction() const;
	virtual f32 getWallCatchHipLimitDegree() const;
	virtual f32 getWallCatchStainAreaOffset() const;
	virtual f32 getGrabCeilRange() const;
	virtual f32 getGrabCeilBodyRadius() const;
	virtual f32 getGrabCeilLeaveSpeedMin() const;
	virtual f32 getGrabCeilLeavePopPower() const;
	virtual f32 getGrabCeilLeavePopGravity() const;
	virtual f32 getGrabCeilSwingStartOffset() const;
	virtual f32 getGrabCeilReverseInputBorder() const;
	virtual f32 getGrabCeilInputPowerBorder() const;
	virtual f32 getGrabCeilSwingWaitEnergy() const;
	virtual f32 getGrabCeilEnableJumpEnergy() const;
	virtual f32 getGrabCeilEnableJumpEnergyMax() const;
	virtual f32 getGrabCeilJumpForceAngle() const;
	virtual f32 getGrabCeilJumpPower() const;
	virtual f32 getGrabCeilJumpMoveMin() const;
	virtual f32 getGrabCeilJumpMoveMax() const;
	virtual f32 getGrabCeilJumpGravity() const;
	virtual s32 getGrabCeilJumpInvalidFrame() const;
	virtual s32 getGrabCeilEnableNextFrame() const;
	virtual s32 getGrabCeilEnableFallSnapFrame() const;
	virtual s32 getPoleClimbPreInputSwing() const;
	virtual f32 getPoleClimbInputRepeatAngle() const;
	virtual f32 getPoleClimbInputDegreeMove() const;
	virtual f32 getPoleClimbCatchRange() const;
	virtual f32 getPoleClimbCatchRangeMin() const;
	virtual f32 getPoleClimbCatchRangeMax() const;
	virtual f32 getPoleClimbJointAngleMin() const;
	virtual f32 getPoleClimbJointAngleMax() const;
	virtual f32 getPoleClimbJointRangeMin() const;
	virtual f32 getPoleClimbJointRangeMax() const;
	virtual f32 getPoleClimbMoveWallDegree() const;
	virtual f32 getPoleClimbUpMargine() const;
	virtual f32 getPoleClimbUpSpeed() const;
	virtual s32 getPoleClimbUpFrame() const;
	virtual s32 getPoleClimbUpFrameFast() const;
	virtual s32 getPoleClimbUpFrameSwing() const;
	virtual f32 getPoleClimbDownSpeed() const;
	virtual f32 getPoleClimbDownSpeedFast() const;
	virtual f32 getPoleClimbDownSpeedSwing() const;
	virtual s32 getPoleClimbDownFrame() const;
	virtual s32 getPoleClimbDownKeepTime() const;
	virtual f32 getPoleClimbTurnDist() const;
	virtual s32 getPoleClimbTurnFrame() const;
	virtual s32 getPoleClimbTurnStopFrame() const;
	virtual s32 getPoleTopStartFrame() const;
	virtual s32 getPoleTopEndFrame() const;
	virtual f32 getPoleTopTurnSpeed() const;
	virtual f32 getPoleTopEndUnderOffsetY() const;
	virtual s32 getGroundSpinFrame() const;
	virtual f32 getGroundSpinMoveSpeedMax() const;
	virtual f32 getGroundSpinAccelRate() const;
	virtual f32 getGroundSpinBrakeRate() const;
	virtual f32 getSpinJumpGravity() const;
	virtual f32 getSpinJumpPower() const;
	virtual f32 getSpinJumpMoveSpeedMax() const;
	virtual f32 getSpinJumpDownFallInitSpeed() const;
	virtual f32 getSpinJumpDownFallPower() const;
	virtual f32 getSpinJumpDownFallSpeedMax() const;
	virtual f32 getSquatBrakeEndSpeed() const;
	virtual f32 getSquatAccelRate() const;
	virtual f32 getSquatBrakeRate() const;
	virtual f32 getSquatBrakeRateOnSkate() const;
	virtual f32 getSquatBrakeSideAccel() const;
	virtual f32 getSquatBrakeSideRate() const;
	virtual f32 getSquatBrakeSideAccelOnSkate() const;
	virtual f32 getSquatBrakeSideRateOnSkate() const;
	virtual f32 getSquatBrakeSideMaxSpeedRate() const;
	virtual f32 getSquatWalkSpeed() const;
	virtual f32 getSquatWalkTurnSpeed() const;
	virtual s32 getSquatWalkTurnFrame() const;
	virtual f32 getSquatJumpCeilSlideSpeed2D() const;
	virtual f32 getHipDropSpeed() const;
	virtual f32 getHipDropGravity() const;
	virtual f32 getHipDropSpeedMax() const;
	virtual s32 getHipDropLandCancelFrame() const;
	virtual f32 getHipDropHeight() const;
	virtual s32 getHipDropMsgInterval() const;
	virtual f32 getJumpHipDropPower() const;
	virtual s32 getJumpHipDropPermitBeginFrame() const;
	virtual s32 getJumpHipDropPermitEndFrame() const;
	virtual f32 getHeadSlidingSpeed() const;
	virtual f32 getHeadSlidingSpeedMin() const;
	virtual f32 getHeadSlidingBrake() const;
	virtual f32 getHeadSlidingSideAccel() const;
	virtual f32 getHeadSlidingJump() const;
	virtual f32 getHeadSlidingGravityAir() const;
	virtual f32 getSwimCenterOffset() const;
	virtual f32 getSwimWallCatchOffset() const;
	virtual f32 getSwimRisePower() const;
	virtual f32 getSwimRiseSpeedMax() const;
	virtual s32 getSwimRiseFrame() const;
	virtual f32 getSwimGravity() const;
	virtual f32 getSwimGravityWalk() const;
	virtual f32 getSwimFallSpeedMax() const;
	virtual f32 getSwimFloorAccelH() const;
	virtual f32 getSwimFloorSpeedMaxH() const;
	virtual f32 getSwimHighAccelH() const;
	virtual f32 getSwimHighSpeedMaxH() const;
	virtual f32 getSwimLowAccelH() const;
	virtual f32 getSwimLowSpeedMaxH() const;
	virtual f32 getSwimBrakeRateH() const;
	virtual f32 getSwimWallHitSpeedMinH() const;
	virtual s32 getSwimHighAccelPermitFrame() const;
	virtual f32 getSwimFlowFieldBlend() const;
	virtual f32 getSwimWalkAnimMinRate() const;
	virtual f32 getSwimWalkAnimMaxRate() const;
	virtual f32 getSwimWalkMaxSpeed() const;
	virtual f32 getSwimSpinCapUpPower() const;
	virtual f32 getSwimSpinCapUpSpeedMax() const;
	virtual f32 getSwimRotStartAngle() const;
	virtual f32 getSwimRotFastAngle() const;
	virtual s32 getSwimRotAccelFrame() const;
	virtual s32 getSwimRotAccelFrameFast() const;
	virtual s32 getSwimRotBrakeFrame() const;
	virtual f32 getSwimRotSpeedChangeStart() const;
	virtual f32 getSwimRotSpeedForward() const;
	virtual f32 getSwimRotSpeedMax() const;
	virtual f32 getSwimSurfaceAccelH() const;
	virtual f32 getSwimSurfaceSpeedMaxH() const;
	virtual s32 getSwimSurfaceSpinCapFrame() const;
	virtual f32 getSwimSurfaceSpinCapSpeedMaxH() const;
	virtual f32 getSwimSurfaceStartDist() const;
	virtual f32 getSwimSurfaceEndDist() const;
	virtual f32 getSwimSurfaceGravity() const;
	virtual f32 getSwimSurfaceBaseHeight() const;
	virtual f32 getSwimSurfaceSpring() const;
	virtual f32 getSwimSurfaceDamper() const;
	virtual s32 getSwimSurfaceDamperStart() const;
	virtual s32 getSwimSurfaceDamperFrame() const;
	virtual f32 getSwimSurfaceEnableJumpHeight() const;
	virtual s32 getSwimSurfacePreInputJumpFrame() const;
	virtual f32 getSwimSurfaceMoveSpring() const;
	virtual f32 getSwimSurfaceMoveDamper() const;
	virtual f32 getSwimSurfaceMoveBaseHeight() const;
	virtual f32 getSwimRunSurfaceBaseHeight() const;
	virtual f32 getSwimRunSurfaceApproachRate() const;
	virtual f32 getSwimRunSurfaceApproachLimit() const;
	virtual f32 getSwimRunSurfaceBrakeBorder() const;
	virtual f32 getSwimRunSurfaceBrakeH() const;
	virtual f32 getSwimRunSurfaceApproachBorderMax() const;
	virtual f32 getSwimRunSurfaceApproachBorderMin() const;
	virtual f32 getSwimRunSurfaceApproachRateMin() const;
	virtual f32 getSwimFallInSpeed() const;
	virtual f32 getSwimFallInBrakeH() const;
	virtual f32 getSwimFallInBrakeV() const;
	virtual f32 getSwimHeadInBrakeH() const;
	virtual f32 getSwimHeadInBrakeV() const;
	virtual f32 getSwimHeadInRisePower() const;
	virtual f32 getSwimHeadInRiseSpeedMax() const;
	virtual f32 getSwimHeadInSurfaceHeight() const;
	virtual s32 getSwimFallInForceSurfaceFrame() const;
	virtual s32 getSwimFallInvalidJumpFrame() const;
	virtual f32 getSwimDiveStartSpeed() const;
	virtual f32 getSwimDiveBrake() const;
	virtual f32 getSwimDiveEndSpeed() const;
	virtual s32 getSwimDiveLandCount() const;
	virtual s32 getSwimDiveLandCancelFrame() const;
	virtual s32 getSwimDiveNoBrakeFrame() const;
	virtual s32 getSwimDiveButtonValidFrame() const;
	virtual s32 getSwimDiveEndFrame() const;
	virtual f32 getSwimDiveInBrakeH() const;
	virtual f32 getSwimDiveInBrakeV() const;
	virtual f32 getSwimDiveInRisePower() const;
	virtual f32 getSwimDiveInRiseSpeedMax() const;
	virtual f32 getSwimDiveInSurfaceHeight() const;
	virtual s32 getSwimDiveInKeepFrame() const;
	virtual s32 getSwimHeadSlidingFrame() const;
	virtual s32 getSwimHeadSlidingBrakeFrame() const;
	virtual f32 getSwimHeadSlidingSpeed() const;
	virtual f32 getSwimHeadSlidingSpeedEnd() const;
	virtual f32 getSwimHeadSlidingBrake() const;
	virtual f32 getSwimHeadSlidingSideAccel() const;
	virtual f32 getSwimHeadSlidingJump() const;
	virtual f32 getSwimHeadSlidingGravity() const;
	virtual s32 getSwimHeadSlidingEndBrakeFrame() const;
	virtual s32 getSwimHeadSlidingEndSpeedMin() const;
	virtual f32 getSwimJumpHipDropSpeed() const;
	virtual f32 getSwimJumpHipDropBrakeV() const;
	virtual f32 getSwimJumpHipDropBrakeVCeiling() const;
	virtual f32 getSwimJumpHipDropGravity() const;
	virtual f32 getSwimJumpHipDropCancelSpeed() const;
	virtual f32 getSwimJumpHipDropAccelH() const;
	virtual f32 getSwimJumpHipDropMoveSpeedH() const;
	virtual f32 getSwimJumpHipDropPopSpeed() const;
	virtual f32 getSwimJumpHipDropPopJumpAdd() const;
	virtual f32 getSwimTramplePower() const;
	virtual f32 getDiveTramplePower() const;
	virtual s32 getDiveTrampleCancelFrame() const;
	virtual f32 getDamageSwimPushPower() const;
	virtual f32 getDamageSwimGravity() const;
	virtual s32 getDamageSwimCancelFrame() const;
	virtual f32 getDamageSwimSurfaceGravity() const;
	virtual f32 getDamageSwimSurfaceHopPower() const;
	virtual f32 getDamageSwimSurfacePushPower() const;
	virtual f32 getDamageSwimSurfaceLandSpeed() const;
	virtual f32 getDamageSwimSurfaceLandBrake() const;
	virtual f32 getDamageSwimSurfaceLandEndSpeed() const;
	virtual s32 getDamageSwimSurfaceCancelFrame() const;
	virtual f32 getDamageSwimBrakeRateGround() const;
	virtual s32 getOxygenReduceFrame() const;
	virtual s32 getOxygenNoReduceFrame() const;
	virtual s32 getOxygenRecoveryFrame() const;
	virtual s32 getOxygenDamageInterval() const;
	virtual s32 getIceWaterDamageInterval() const;
	virtual s32 getIceWaterRecoveryFrame() const;
	virtual f32 getMoveAnimSpeedMax() const;
	virtual f32 getAnimFrameRateSpeedMin() const;
	virtual f32 getRunBorderSpeed() const;
	virtual f32 getRunBlendRange() const;
	virtual f32 getDashBorderSpeed() const;
	virtual f32 getDashBlendRange() const;
	virtual f32 getDashFastBorderSpeed() const;
	virtual f32 getDashFastBlendRange() const;
	virtual f32 getAnimFrameRateSpeedMax() const;
	virtual f32 getAnimFrameRateRunStart() const;
	virtual f32 getAnimFrameRateMinRun() const;
	virtual f32 getAnimFrameRateMaxRun() const;
	virtual f32 getAnimFrameRateMaxDash() const;
	virtual f32 getAnimFrameRateMaxDashFast() const;
	virtual f32 getRunStartPlayFrameScale() const;
	virtual s32 getRunStartBlendFrame() const;
	virtual f32 getDamageFireRunAnimRate() const;
	virtual f32 getRunSkateAnimSpeedOffset() const;
	virtual f32 getAnimFrameRateRange2D() const;
	virtual f32 getAnimFrameRateMinRun2D() const;
	virtual f32 getAnimFrameRateMaxRun2D() const;
	virtual s32 getIKBlendFrameRun() const;
	virtual f32 getIKBlendRateRunMin() const;
	virtual f32 getIKBlendRateRunMax() const;
	virtual f32 getRollingAnimBorderSpeedMin() const;
	virtual f32 getRollingAnimBorderSpeedMax() const;
	virtual f32 getRollingAnimFrameRateMin() const;
	virtual f32 getRollingAnimFrameRateMax() const;
	virtual s32 getSwimPaddleAnimInterval() const;
	virtual s32 getSwimPaddleAnimRateIntervalMax() const;
	virtual s32 getSwimPaddleAnimRateIntervalMin() const;
	virtual f32 getSwimPaddleAnimMaxRate() const;
	virtual f32 getSwimBentForwardMax() const;
	virtual f32 getSwimBentForwardBlendRate() const;
	virtual f32 getSwimBentSideMax() const;
	virtual f32 getSwimBentSpineMax() const;
	virtual f32 getSwimBentSideBlendRate() const;
	virtual f32 getSwimBentFrontMax() const;
	virtual f32 getSwimBentFrontBlendRate() const;
	virtual f32 getSwimWalkAnimSpeedMax() const;
	virtual f32 getSwimWalkAnimSpeedMin() const;
	virtual f32 getSwimWalkAnimFrameRateMax() const;
	virtual f32 getSwimWalkAnimFrameRateMin() const;
	virtual f32 getSandSinkBorderMin() const;
	virtual f32 getSandSinkBorderMax() const;
	virtual f32 getSandSinkBorderRateMin() const;
	virtual f32 getSandSinkBorderRateMax() const;
	virtual f32 getSandSinkFrameRateMin() const;
	virtual f32 getSandSinkFrameRateMax() const;
	virtual s32 getLookAtEyeKeepFrame() const;
	virtual s32 getLookAtEyeKeepFrameInSight() const;
	virtual s32 getLookAtEyeKeepFrameWait() const;
	virtual f32 getLookAtEyeDistance() const;
	virtual f32 getLookAtEyeAngleMinH() const;
	virtual f32 getLookAtEyeAngleMinInSightH() const;
	virtual f32 getLookAtEyeAngleMaxH() const;
	virtual f32 getLookAtEyeAngleMinV() const;
	virtual f32 getLookAtEyeAngleMinInSightV() const;
	virtual f32 getLookAtEyeAngleMaxV() const;
	virtual f32 getTiltEyeBorderStart() const;
	virtual f32 getTiltEyeBorderEnd() const;
	virtual f32 getTiltEyeAngleScale() const;
	virtual f32 getCenterTiltRateMax() const;
	virtual f32 getNoseChildLocalOffset() const;
	virtual f32 getNoseStability() const;
	virtual f32 getNoseFriction() const;
	virtual f32 getNoseLimitDegree() const;
	virtual f32 getMustacheChildLocalOffset() const;
	virtual f32 getMustacheStability() const;
	virtual f32 getMustacheFriction() const;
	virtual f32 getMustacheLimitDegree() const;
	virtual s32 getCapInterpolateFrame() const;
	virtual f32 getCapChildLocalOffset() const;
	virtual f32 getCapStability() const;
	virtual f32 getCapFriction() const;
	virtual f32 getCapLimitDegree() const;
	virtual f32 getCapTransStability() const;
	virtual f32 getCapTransFriction() const;
	virtual f32 getCapTransLimit() const;
	virtual s32 getCapManHeroEyesWaitAppearFrame() const;
	virtual s32 getDeadWipeStartDamage() const;
	virtual s32 getDeadWipeWaitDamage() const;
	virtual s32 getDeadWipeStartAbyss() const;
	virtual s32 getDeadWipeWaitAbyss() const;
	virtual s32 getDeadWipeStartAbyssWithCapMsg() const;
	virtual s32 getDeadWipeWaitAbyssWithCapMsg() const;
	virtual s32 getDeadWipeStartPress() const;
	virtual s32 getDeadWipeWaitPress() const;
	virtual s32 getDeadWipeStartSandSink() const;
	virtual s32 getDeadWipeWaitSandSink() const;
	virtual s32 getDeadWipeStartNoOxygen() const;
	virtual s32 getDeadWipeWaitNoOxygen() const;
	virtual s32 getDeadWipeStartIceWater() const;
	virtual s32 getDeadWipeWaitIceWater() const;
	virtual f32 getCoinDashSpeed() const;
	virtual f32 getCoinDashSpeedLimit() const;
	virtual f32 getAdditionalSpeedLimit() const;

	f32 mGravity; // _8
	f32 mFrictionAttack; // _C
	f32 mPushPower; // _10
	f32 mWaitPoseDegreeMax; // _14
	f32 mHillPoseDegreeMax; // _18
	f32 mTiltPoseDegreeMax; // _1C
	f32 mSlerpQuatRate; // _20
	f32 mSlerpQuatRateWait; // _24
	f32 mSlerpQuatGrav; // _28
	s32 mPreInputFrameCapThrow; // _2C
	s32 mEnableActionFrameCapCatch; // _30
	f32 mJumpPowerCapCatch; // _34
	f32 mJumpGravityCapCatch; // _38
	s32 mRunTimeContinuousThrow; // _3C
	f32 mRunSpeedMaxContinuousThrow; // _40
	s32 mRunAccelFrameContinuousThrow; // _44
	f32 mSeparateCheckHeight; // _48
	f32 mSeparateOffsetLerpRate; // _4C
	f32 mSeparateEnableThrowHeight; // _50
	f32 mTall; // _54
	f32 mCollisionRadius; // _58
	f32 mCollisionRadiusSquat; // _5C
	f32 mCollisionRadiusStand; // _60
	f32 mCollisionSmallStepHeight; // _64
	f32 mCollisionResetLimit; // _68
	f32 mCollisionResetLimitHigh; // _6C
	f32 mReflectCeilingPower; // _70
	f32 mReflectTossPower; // _74
	f32 mReflectUpperPunchScaleH; // _78
	f32 mCollisionHitDownAngleH; // _7C
	f32 mCollisionHitDownEscapeAngleV; // _80
	f32 mShadowDropHeightScale; // _84
	f32 mShadowDropNormalAdd; // _88
	f32 mShadowDropLengthMin; // _8C
	f32 mShadowDropLengthMax; // _90
	f32 mShadowDropLengthExtend; // _94
	f32 mGravityDamage; // _98
	f32 mHopPowerDamage; // _9C
	f32 mPushPowerDamage; // _A0
	s32 mDamageCancelFrame; // _A4
	s32 mDamageInvalidCount; // _A8
	s32 mDamageInvalidCountRecovery; // _AC
	s32 mDamageInvalidCountAbyss; // _B0
	f32 mNormalMinSpeed2D; // _B4
	f32 mNormalMaxSpeed2D; // _B8
	f32 mDashMaxSpeed2D; // _BC
	s32 mNormalAccelFrame2D; // _C0
	s32 mDashAccelFrame2D; // _C4
	s32 mNormalDashAnimFrame2D; // _C8
	s32 mNormalBrakeFrame2D; // _CC
	s32 mStickOnBrakeFrame2D; // _D0
	s32 mBrakeTurnStartFrame2D; // _D4
	f32 mTurnEndSpeedRate2D; // _D8
	f32 mJumpPowerMin2DArea; // _DC
	f32 mJumpPowerMax2DArea; // _E0
	f32 mJumpPowerMinBorder2D; // _E4
	f32 mJumpPowerMaxBorder2D; // _E8
	f32 mGravityMove; // _EC
	f32 mNormalMaxSpeed; // _F0
	f32 mNormalMinSpeed; // _F4
	s32 mNormalAccelFrame; // _F8
	f32 mRunAccelAverageScale; // _FC
	s32 mNormalBrakeFrame; // _100
	f32 mDashJudgeSpeed; // _104
	s32 mStickOnBrakeFrame; // _108
	s32 mNormalDashAnimFrame; // _10C
	f32 mRunAfterTurnSpeedMax; // _110
	f32 mRunAfterTurnScale; // _114
	s32 mRunAfterTurnFrame; // _118
	s32 mBrakeTurnStartFrame; // _11C
	f32 mBrakeOnSpeedRate; // _120
	s32 mBrakeOnCounterBorder; // _124
	s32 mWallPushFrame; // _128
	s32 mRunDeepDownFrame; // _12C
	s32 mRunDeepDownMargine; // _130
	s32 mQuickTurnJumpFrame; // _134
	s32 mRoundAccelFrame; // _138
	s32 mRoundBrakeFrame; // _13C
	f32 mRoundFastDegree; // _140
	s32 mRoundAccelFrameFast; // _144
	f32 mRoundMinDegree; // _148
	s32 mRoundBrakeFrameForce; // _14C
	f32 mRoundFastDegreeForce; // _150
	f32 mRoundLimitDegreeForce; // _154
	f32 mRoundLimitDegreeForceFast; // _158
	s32 mRoundAccelFrameForceFast; // _15C
	f32 mRoundLimitDegreeMin; // _160
	f32 mRoundLimitDegree; // _164
	s32 mIceAccelFrame; // _168
	s32 mIceBrakeFrame; // _16C
	s32 mIceBrakeFrameHigh; // _170
	s32 mIceBrakeFrameWall; // _174
	s32 mIceRoundAccelFrame; // _178
	s32 mIceRoundAccelFrameFast; // _17C
	s32 mIceRoundBrakeFrame; // _180
	f32 mIceRoundFastDegree; // _184
	f32 mIceRoundMinDegree; // _188
	f32 mIceRoundLimitDegree; // _18C
	f32 mHillAddSpeed; // _190
	f32 mHillSubSpeed; // _194
	s32 mHillAccelAddFrame; // _198
	s32 mHillAccelSubFrame; // _19C
	f32 mHillAccelSubAngleMin; // _1A0
	f32 mHillAccelSubAngleMax; // _1A4
	f32 mStandAngleMin; // _1A8
	f32 mStandAngleMax; // _1AC
	f32 mHillAngleSpeedMin; // _1B0
	f32 mHillAngleSpeedMax; // _1B4
	s32 mSpinCapThrowFrame; // _1B8
	s32 mSpinCapThrowFrameAir; // _1BC
	s32 mSpinCapThrowFrameSwim; // _1C0
	s32 mSpinCapThrowFrameSwing; // _1C4
	s32 mSpinCapThrowFrameContinuous; // _1C8
	s32 mSpinAttackFrame; // _1CC
	s32 mSpinBrakeFrame; // _1D0
	f32 mSpinAirJumpPower; // _1D4
	f32 mSpinAirSpeedMax; // _1D8
	f32 mGravitySpinAir; // _1DC
	f32 mSlerpQuatRateSpinAir; // _1E0
	f32 mSpinBrakeRate; // _1E4
	f32 mSpinBrakeSideAccel; // _1E8
	f32 mSpinBrakeSideBrakeRate; // _1EC
	f32 mSpinBrakeSideMaxSpeedRate; // _1F0
	f32 mSpinRoundLimitDegree; // _1F4
	f32 mDamageFireJumpPower1st; // _1F8
	f32 mDamageFireJumpPower2nd; // _1FC
	f32 mDamageFireJumpMoveSpeed; // _200
	f32 mDamageFireCeilHitSpeed; // _204
	f32 mDamageFireGravity; // _208
	s32 mDamageFireNoGravityFrame; // _20C
	s32 mDamageFireRunTime; // _210
	f32 mDamageFireRunSpeed; // _214
	f32 mDamageFireRunBrakeFrame; // _218
	s32 mSandSinkDeadTime; // _21C
	s32 mSandSinkBrakeHeightH; // _220
	s32 mSandSinkBrakeHeightV; // _224
	f32 mSandSinkHeight; // _228
	f32 mSandSinkCapThrow; // _22C
	f32 mSandSinkBrakeMinH; // _230
	f32 mSandSinkBrakeMaxH; // _234
	f32 mSandSinkBrakeMinV; // _238
	f32 mSandSinkBrakeMaxV; // _23C
	f32 mSlopeSlideAngleStart; // _240
	f32 mSlopeSlideAngleEnd; // _244
	f32 mSlopeSlideAccel; // _248
	f32 mSlopeSlideBrake; // _24C
	f32 mSlopeSlideMaxSpeed; // _250
	f32 mSlopeSlideSpeedEnd; // _254
	f32 mSlopeSlideSideAccel; // _258
	f32 mSlopeSlideSideBrake; // _25C
	f32 mSlopeSlideSideMaxSpeed; // _260
	f32 mSlopeTurnDegree; // _264
	s32 mSlideInvalidFrame; // _268
	s32 mSlopeForceFrame; // _26C
	f32 mSlopeSlideForceSideAccel; // _270
	f32 mSlopeSlideForceSideBrake; // _274
	f32 mSlopeSlideForceSideMaxSpeed; // _278
	f32 mSlopeSlideForceTurnDegree; // _27C
	f32 mSlopeRollingSpeedStart; // _280
	f32 mSlopeRollingSpeedBoost; // _284
	f32 mSlopeRollingMaxSpeed; // _288
	s32 mSlopeRollingFrameMinBoost; // _28C
	s32 mSlopeRollingFrameMin; // _290
	f32 mSlopeRollingStartJumpPower; // _294
	f32 mSlopeRollingStartSlideSpeed; // _298
	f32 mSlopeRollingAccel; // _29C
	f32 mSlopeRollingBrake; // _2A0
	f32 mSlopeRollingAgainst; // _2A4
	f32 mSlopeRollingAnglePowerMax; // _2A8
	f32 mSlopeRollingSpeedEnd; // _2AC
	f32 mSlopeRollingSideAccel; // _2B0
	f32 mSlopeRollingSideBrake; // _2B4
	f32 mSlopeRollingSideMaxSpeed; // _2B8
	s32 mSlopeRollingUnRollFrame; // _2BC
	f32 mSlopeRollingEndBrake; // _2C0
	f32 mSlopeRollingEndBrakeEndSpeed; // _2C4
	f32 mSlopeRollingReStartAccel; // _2C8
	f32 mSlopeRollingReStartMaxAdd; // _2CC
	s32 mSlopeRollingReStartInterval; // _2D0
	s32 mSlopeRollingReStartSwing; // _2D4
	s32 mSlopeRollingReStartCharge; // _2D8
	s32 mSlopeRollingReStartForce; // _2DC
	f32 mSlopeRollingAccelOnSkate; // _2E0
	f32 mSlopeRollingSideAccelOnSkate; // _2E4
	f32 mSlopeRollingBrakeOnSkate; // _2E8
	s32 mExtendFrame; // _2EC
	f32 mJumpInertiaRate; // _2F0
	f32 mJumpPowerMin; // _2F4
	f32 mJumpPowerMax; // _2F8
	f32 mJumpGravity; // _2FC
	f32 mJumpBaseSpeedMax; // _300
	f32 mJumpMoveSpeedMin; // _304
	f32 mJumpMoveSpeedMax; // _308
	f32 mJumpAccelFront; // _30C
	f32 mJumpAccelBack; // _310
	f32 mJumpAccelTurn; // _314
	f32 mJumpTurnAngleStart; // _318
	f32 mJumpTurnAngleLimit; // _31C
	f32 mJumpTurnAngleFast; // _320
	f32 mJumpTurnAngleFastLimit; // _324
	s32 mJumpTurnAccelFrame; // _328
	s32 mJumpTurnAccelFrameFast; // _32C
	s32 mJumpTurnBrakeFrame; // _330
	f32 mTrampleGravity; // _334
	f32 mTrampleJumpPower; // _338
	f32 mTrampleHighGravity; // _33C
	f32 mTrampleHighJumpPower; // _340
	f32 mTrampleGravity2D; // _344
	f32 mTrampleJumpPower2D; // _348
	f32 mTrampleHighGravity2D; // _34C
	f32 mTrampleHighJumpPower2D; // _350
	f32 mTrampleHipDropGravity; // _354
	f32 mTrampleHipDropJumpPower; // _358
	f32 mTrampleRisingBrakeVelH; // _35C
	f32 mTrampleJumpCodePower; // _360
	f32 mTrampleJumpCodePowerSmall; // _364
	f32 mCapLeapFrogJumpGravity; // _368
	f32 mCapLeapFrogJumpPower; // _36C
	f32 mCapLeapFrogJumpPowerAir; // _370
	f32 mObjLeapFrogJumpPower; // _374
	f32 mObjLeapFrogJumpPowerHigh; // _378
	f32 mCapHeadSpringJumpGravity; // _37C
	f32 mCapHeadSpringJumpPower; // _380
	f32 mCapHeadSpringJumpGravityHigh; // _384
	f32 mCapHeadSpringJumpPowerHigh; // _388
	f32 mCapHeadSpringSpeedMax; // _38C
	s32 mContinuousJumpPreInputFrame; // _390
	s32 mContinuousJumpCount; // _394
	s32 mContinuousJumpTimer; // _398
	f32 mContinuousJumpPowerMin; // _39C
	f32 mJumpPowerMax2nd; // _3A0
	f32 mJumpGravity2nd; // _3A4
	f32 mJumpPowerMax3rd; // _3A8
	f32 mJumpGravity3rd; // _3AC
	f32 mSpinFlowerJumpGravity; // _3B0
	f32 mSpinFlowerJumpFallSpeedMax; // _3B4
	f32 mSpinFlowerJumpMovePower; // _3B8
	f32 mSpinFlowerJumpVelMax; // _3BC
	s32 mSpinFlowerJumpStayFrame; // _3C0
	f32 mSpinFlowerJumpStaySpeedMax; // _3C4
	f32 mSpinFlowerJumpNoInputBrake; // _3C8
	f32 mSpinFlowerJumpDownFallInitSpeed; // _3CC
	f32 mSpinFlowerJumpDownFallPower; // _3D0
	f32 mSpinFlowerJumpDownFallSpeedMax; // _3D4
	f32 mJumpGravityForceRun; // _3D8
	f32 mJumpPowerForceRun; // _3DC
	f32 mCapCatchPopPower; // _3E0
	f32 mCapCatchPopGravity; // _3E4
	f32 mSquatJumpGravity; // _3E8
	f32 mSquatJumpPower; // _3EC
	f32 mSquatJumpBackPower; // _3F0
	f32 mSquatJumpMovePowerFront; // _3F4
	f32 mSquatJumpMovePowerSide; // _3F8
	f32 mSquatJumpMoveSpeedMax; // _3FC
	f32 mTurnJumpGravity; // _400
	f32 mTurnJumpPower; // _404
	f32 mTurnJumpVelH; // _408
	f32 mTurnJumpBrake; // _40C
	f32 mTurnJumpAccel; // _410
	f32 mTurnJumpSideAccel; // _414
	f32 mLongJumpAccel; // _418
	f32 mLongJumpBrake; // _41C
	f32 mLongJumpSideAccel; // _420
	f32 mLongJumpGravity; // _424
	f32 mLongJumpJumpPow; // _428
	f32 mLongJumpMovePow; // _42C
	f32 mLongJumpInitSpeed; // _430
	f32 mLongJumpSpeed; // _434
	f32 mLongJumpSpeedMin; // _438
	s32 mContinuousLongJumpCount; // _43C
	s32 mContinuousLongJumpTimer; // _440
	f32 mGravityAir; // _444
	f32 mFrictionAir; // _448
	f32 mFallSpeedMax; // _44C
	f32 mLongFallDistance; // _450
	f32 mFallWallScaleVelocity; // _454
	s32 mDownFallFrameMin; // _458
	f32 mGravityWallSlide; // _45C
	f32 mWallHeightLowLimit; // _460
	f32 mWallKeepDegree; // _464
	s32 mWallKeepFrame; // _468
	f32 mWallJumpGravity; // _46C
	f32 mWallJumpHSpeed; // _470
	f32 mWallJumpPower; // _474
	s32 mWallJumpInvalidateInputFrame; // _478
	s32 mWallInhibitAfterPunch; // _47C
	f32 mWallFollowAngleH; // _480
	f32 mWallFollowAngleV; // _484
	f32 mWallCatchDegree; // _488
	f32 mWallCatchHeightEdgeTop; // _48C
	f32 mWallCatchHeightBottom; // _490
	f32 mWallCatchKeepDegree; // _494
	f32 mWallCatchMoveDegree; // _498
	f32 mWallCatchMoveSpeed; // _49C
	f32 mWallCatchMoveHeightRange; // _4A0
	s32 mWallCatchMoveInterpolate; // _4A4
	s32 mWallCatchMoveFrame; // _4A8
	s32 mWallCatchMoveFrameFast; // _4AC
	s32 mWallCatchMoveFrameSwing; // _4B0
	f32 mWallCatchInputRepeatAngle; // _4B4
	f32 mWallClimbDegree; // _4B8
	s32 mWallClimbJumpStartFrame; // _4BC
	s32 mWallClimbJumpEndFrame; // _4C0
	s32 mWallClimbStartFrame; // _4C4
	f32 mWallClimbGravity; // _4C8
	f32 mWallFallJumpSpeed; // _4CC
	f32 mWallClimbJumpSpeedV; // _4D0
	f32 mWallClimbJumpSpeedH; // _4D4
	f32 mWallClimbJumpGravity; // _4D8
	s32 mWallClimbJumpInvalidFrame; // _4DC
	f32 mWallCatchHipLocalOffset; // _4E0
	f32 mWallCatchHipStability; // _4E4
	f32 mWallCatchHipFriction; // _4E8
	f32 mWallCatchHipLimitDegree; // _4EC
	f32 mWallCatchStainAreaOffset; // _4F0
	f32 mGrabCeilRange; // _4F4
	f32 mGrabCeilBodyRadius; // _4F8
	f32 mGrabCeilLeaveSpeedMin; // _4FC
	f32 mGrabCeilLeavePopPower; // _500
	f32 mGrabCeilLeavePopGravity; // _504
	f32 mGrabCeilSwingStartOffset; // _508
	f32 mGrabCeilReverseInputBorder; // _50C
	f32 mGrabCeilInputPowerBorder; // _510
	f32 mGrabCeilSwingWaitEnergy; // _514
	f32 mGrabCeilEnableJumpEnergy; // _518
	f32 mGrabCeilEnableJumpEnergyMax; // _51C
	f32 mGrabCeilJumpForceAngle; // _520
	f32 mGrabCeilJumpPower; // _524
	f32 mGrabCeilJumpMoveMin; // _528
	f32 mGrabCeilJumpMoveMax; // _52C
	f32 mGrabCeilJumpGravity; // _530
	s32 mGrabCeilJumpInvalidFrame; // _534
	s32 mGrabCeilEnableNextFrame; // _538
	s32 mGrabCeilEnableFallSnapFrame; // _53C
	s32 mPoleClimbPreInputSwing; // _540
	f32 mPoleClimbInputRepeatAngle; // _544
	f32 mPoleClimbInputDegreeMove; // _548
	f32 mPoleClimbCatchRange; // _54C
	f32 mPoleClimbCatchRangeMin; // _550
	f32 mPoleClimbCatchRangeMax; // _554
	f32 mPoleClimbJointAngleMin; // _558
	f32 mPoleClimbJointAngleMax; // _55C
	f32 mPoleClimbJointRangeMin; // _560
	f32 mPoleClimbJointRangeMax; // _564
	f32 mPoleClimbMoveWallDegree; // _568
	f32 mPoleClimbUpMargine; // _56C
	f32 mPoleClimbUpSpeed; // _570
	s32 mPoleClimbUpFrame; // _574
	s32 mPoleClimbUpFrameFast; // _578
	s32 mPoleClimbUpFrameSwing; // _57C
	f32 mPoleClimbDownSpeed; // _580
	f32 mPoleClimbDownSpeedFast; // _584
	f32 mPoleClimbDownSpeedSwing; // _588
	s32 mPoleClimbDownFrame; // _58C
	s32 mPoleClimbDownKeepTime; // _590
	f32 mPoleClimbTurnDist; // _594
	s32 mPoleClimbTurnFrame; // _598
	s32 mPoleClimbTurnStopFrame; // _59C
	s32 mPoleTopStartFrame; // _5A0
	s32 mPoleTopEndFrame; // _5A4
	f32 mPoleTopTurnSpeed; // _5A8
	f32 mPoleTopEndUnderOffsetY; // _5AC
	s32 mGroundSpinFrame; // _5B0
	f32 mGroundSpinMoveSpeedMax; // _5B4
	f32 mGroundSpinAccelRate; // _5B8
	f32 mGroundSpinBrakeRate; // _5BC
	f32 mSpinJumpGravity; // _5C0
	f32 mSpinJumpPower; // _5C4
	f32 mSpinJumpMoveSpeedMax; // _5C8
	f32 mSpinJumpDownFallInitSpeed; // _5CC
	f32 mSpinJumpDownFallPower; // _5D0
	f32 mSpinJumpDownFallSpeedMax; // _5D4
	f32 mSquatBrakeEndSpeed; // _5D8
	f32 mSquatAccelRate; // _5DC
	f32 mSquatBrakeRate; // _5E0
	f32 mSquatBrakeRateOnSkate; // _5E4
	f32 mSquatBrakeSideAccel; // _5E8
	f32 mSquatBrakeSideRate; // _5EC
	f32 mSquatBrakeSideAccelOnSkate; // _5F0
	f32 mSquatBrakeSideRateOnSkate; // _5F4
	f32 mSquatBrakeSideMaxSpeedRate; // _5F8
	f32 mSquatWalkSpeed; // _5FC
	f32 mSquatWalkTurnSpeed; // _600
	s32 mSquatWalkTurnFrame; // _604
	f32 mSquatJumpCeilSlideSpeed2D; // _608
	f32 mHipDropSpeed; // _60C
	f32 mHipDropGravity; // _610
	f32 mHipDropSpeedMax; // _614
	s32 mHipDropLandCancelFrame; // _618
	f32 mHipDropHeight; // _61C
	s32 mHipDropMsgInterval; // _620
	f32 mJumpHipDropPower; // _624
	s32 mJumpHipDropPermitBeginFrame; // _628
	s32 mJumpHipDropPermitEndFrame; // _62C
	f32 mHeadSlidingSpeed; // _630
	f32 mHeadSlidingSpeedMin; // _634
	f32 mHeadSlidingBrake; // _638
	f32 mHeadSlidingSideAccel; // _63C
	f32 mHeadSlidingJump; // _640
	f32 mHeadSlidingGravityAir; // _644
	f32 mSwimCenterOffset; // _648
	f32 mSwimWallCatchOffset; // _64C
	f32 mSwimRisePower; // _650
	f32 mSwimRiseSpeedMax; // _654
	s32 mSwimRiseFrame; // _658
	f32 mSwimGravity; // _65C
	f32 mSwimGravityWalk; // _660
	f32 mSwimFallSpeedMax; // _664
	f32 mSwimFloorAccelH; // _668
	f32 mSwimFloorSpeedMaxH; // _66C
	f32 mSwimHighAccelH; // _670
	f32 mSwimHighSpeedMaxH; // _674
	f32 mSwimLowAccelH; // _678
	f32 mSwimLowSpeedMaxH; // _67C
	f32 mSwimBrakeRateH; // _680
	f32 mSwimWallHitSpeedMinH; // _684
	s32 mSwimHighAccelPermitFrame; // _688
	f32 mSwimFlowFieldBlend; // _68C
	f32 mSwimWalkAnimMinRate; // _690
	f32 mSwimWalkAnimMaxRate; // _694
	f32 mSwimWalkMaxSpeed; // _698
	f32 mSwimSpinCapUpPower; // _69C
	f32 mSwimSpinCapUpSpeedMax; // _6A0
	f32 mSwimRotStartAngle; // _6A4
	f32 mSwimRotFastAngle; // _6A8
	s32 mSwimRotAccelFrame; // _6AC
	s32 mSwimRotAccelFrameFast; // _6B0
	s32 mSwimRotBrakeFrame; // _6B4
	f32 mSwimRotSpeedChangeStart; // _6B8
	f32 mSwimRotSpeedForward; // _6BC
	f32 mSwimRotSpeedMax; // _6C0
	f32 mSwimSurfaceAccelH; // _6C4
	f32 mSwimSurfaceSpeedMaxH; // _6C8
	s32 mSwimSurfaceSpinCapFrame; // _6CC
	f32 mSwimSurfaceSpinCapSpeedMaxH; // _6D0
	f32 mSwimSurfaceStartDist; // _6D4
	f32 mSwimSurfaceEndDist; // _6D8
	f32 mSwimSurfaceGravity; // _6DC
	f32 mSwimSurfaceBaseHeight; // _6E0
	f32 mSwimSurfaceSpring; // _6E4
	f32 mSwimSurfaceDamper; // _6E8
	s32 mSwimSurfaceDamperStart; // _6EC
	s32 mSwimSurfaceDamperFrame; // _6F0
	f32 mSwimSurfaceEnableJumpHeight; // _6F4
	s32 mSwimSurfacePreInputJumpFrame; // _6F8
	f32 mSwimSurfaceMoveSpring; // _6FC
	f32 mSwimSurfaceMoveDamper; // _700
	f32 mSwimSurfaceMoveBaseHeight; // _704
	f32 mSwimRunSurfaceBaseHeight; // _708
	f32 mSwimRunSurfaceApproachRate; // _70C
	f32 mSwimRunSurfaceApproachLimit; // _710
	f32 mSwimRunSurfaceBrakeBorder; // _714
	f32 mSwimRunSurfaceBrakeH; // _718
	f32 mSwimRunSurfaceApproachBorderMax; // _71C
	f32 mSwimRunSurfaceApproachBorderMin; // _720
	f32 mSwimRunSurfaceApproachRateMin; // _724
	f32 mSwimFallInSpeed; // _728
	f32 mSwimFallInBrakeH; // _72C
	f32 mSwimFallInBrakeV; // _730
	f32 mSwimHeadInBrakeH; // _734
	f32 mSwimHeadInBrakeV; // _738
	f32 mSwimHeadInRisePower; // _73C
	f32 mSwimHeadInRiseSpeedMax; // _740
	f32 mSwimHeadInSurfaceHeight; // _744
	s32 mSwimFallInForceSurfaceFrame; // _748
	s32 mSwimFallInvalidJumpFrame; // _74C
	f32 mSwimDiveStartSpeed; // _750
	f32 mSwimDiveBrake; // _754
	f32 mSwimDiveEndSpeed; // _758
	s32 mSwimDiveLandCount; // _75C
	s32 mSwimDiveLandCancelFrame; // _760
	s32 mSwimDiveNoBrakeFrame; // _764
	s32 mSwimDiveButtonValidFrame; // _768
	s32 mSwimDiveEndFrame; // _76C
	f32 mSwimDiveInBrakeH; // _770
	f32 mSwimDiveInBrakeV; // _774
	f32 mSwimDiveInRisePower; // _778
	f32 mSwimDiveInRiseSpeedMax; // _77C
	f32 mSwimDiveInSurfaceHeight; // _780
	s32 mSwimDiveInKeepFrame; // _784
	s32 mSwimHeadSlidingFrame; // _788
	s32 mSwimHeadSlidingBrakeFrame; // _78C
	f32 mSwimHeadSlidingSpeed; // _790
	f32 mSwimHeadSlidingSpeedEnd; // _794
	f32 mSwimHeadSlidingBrake; // _798
	f32 mSwimHeadSlidingSideAccel; // _79C
	f32 mSwimHeadSlidingJump; // _7A0
	f32 mSwimHeadSlidingGravity; // _7A4
	s32 mSwimHeadSlidingEndBrakeFrame; // _7A8
	s32 mSwimHeadSlidingEndSpeedMin; // _7AC
	f32 mSwimJumpHipDropSpeed; // _7B0
	f32 mSwimJumpHipDropBrakeV; // _7B4
	f32 mSwimJumpHipDropBrakeVCeiling; // _7B8
	f32 mSwimJumpHipDropGravity; // _7BC
	f32 mSwimJumpHipDropCancelSpeed; // _7C0
	f32 mSwimJumpHipDropAccelH; // _7C4
	f32 mSwimJumpHipDropMoveSpeedH; // _7C8
	f32 mSwimJumpHipDropPopSpeed; // _7CC
	f32 mSwimJumpHipDropPopJumpAdd; // _7D0
	f32 mSwimTramplePower; // _7D4
	f32 mDiveTramplePower; // _7D8
	s32 mDiveTrampleCancelFrame; // _7DC
	f32 mDamageSwimPushPower; // _7E0
	f32 mDamageSwimGravity; // _7E4
	s32 mDamageSwimCancelFrame; // _7E8
	f32 mDamageSwimSurfaceGravity; // _7EC
	f32 mDamageSwimSurfaceHopPower; // _7F0
	f32 mDamageSwimSurfacePushPower; // _7F4
	f32 mDamageSwimSurfaceLandSpeed; // _7F8
	f32 mDamageSwimSurfaceLandBrake; // _7FC
	f32 mDamageSwimSurfaceLandEndSpeed; // _800
	s32 mDamageSwimSurfaceCancelFrame; // _804
	f32 mDamageSwimBrakeRateGround; // _808
	s32 mOxygenReduceFrame; // _80C
	s32 mOxygenNoReduceFrame; // _810
	s32 mOxygenRecoveryFrame; // _814
	s32 mOxygenDamageInterval; // _818
	s32 mIceWaterDamageInterval; // _81C
	s32 mIceWaterRecoveryFrame; // _820
	f32 mMoveAnimSpeedMax; // _824
	f32 mAnimFrameRateSpeedMin; // _828
	f32 mRunBorderSpeed; // _82C
	f32 mRunBlendRange; // _830
	f32 mDashBorderSpeed; // _834
	f32 mDashBlendRange; // _838
	f32 mDashFastBorderSpeed; // _83C
	f32 mDashFastBlendRange; // _840
	f32 mAnimFrameRateSpeedMax; // _844
	f32 mAnimFrameRateRunStart; // _848
	f32 mAnimFrameRateMinRun; // _84C
	f32 mAnimFrameRateMaxRun; // _850
	f32 mAnimFrameRateMaxDash; // _854
	f32 mAnimFrameRateMaxDashFast; // _858
	f32 mRunStartPlayFrameScale; // _85C
	s32 mRunStartBlendFrame; // _860
	f32 mDamageFireRunAnimRate; // _864
	f32 mRunSkateAnimSpeedOffset; // _868
	f32 mAnimFrameRateRange2D; // _86C
	f32 mAnimFrameRateMinRun2D; // _870
	f32 mAnimFrameRateMaxRun2D; // _874
	s32 mIKBlendFrameRun; // _878
	f32 mIKBlendRateRunMin; // _87C
	f32 mIKBlendRateRunMax; // _880
	f32 mRollingAnimBorderSpeedMin; // _884
	f32 mRollingAnimBorderSpeedMax; // _888
	f32 mRollingAnimFrameRateMin; // _88C
	f32 mRollingAnimFrameRateMax; // _890
	s32 mSwimPaddleAnimInterval; // _894
	s32 mSwimPaddleAnimRateIntervalMax; // _898
	s32 mSwimPaddleAnimRateIntervalMin; // _89C
	f32 mSwimPaddleAnimMaxRate; // _8A0
	f32 mSwimBentForwardMax; // _8A4
	f32 mSwimBentForwardBlendRate; // _8A8
	f32 mSwimBentSideMax; // _8AC
	f32 mSwimBentSpineMax; // _8B0
	f32 mSwimBentSideBlendRate; // _8B4
	f32 mSwimBentFrontMax; // _8B8
	f32 mSwimBentFrontBlendRate; // _8BC
	f32 mSwimWalkAnimSpeedMax; // _8C0
	f32 mSwimWalkAnimSpeedMin; // _8C4
	f32 mSwimWalkAnimFrameRateMax; // _8C8
	f32 mSwimWalkAnimFrameRateMin; // _8CC
	f32 mSandSinkBorderMin; // _8D0
	f32 mSandSinkBorderMax; // _8D4
	f32 mSandSinkBorderRateMin; // _8D8
	f32 mSandSinkBorderRateMax; // _8DC
	f32 mSandSinkFrameRateMin; // _8E0
	f32 mSandSinkFrameRateMax; // _8E4
	s32 mLookAtEyeKeepFrame; // _8E8
	s32 mLookAtEyeKeepFrameInSight; // _8EC
	s32 mLookAtEyeKeepFrameWait; // _8F0
	f32 mLookAtEyeDistance; // _8F4
	f32 mLookAtEyeAngleMinH; // _8F8
	f32 mLookAtEyeAngleMinInSightH; // _8FC
	f32 mLookAtEyeAngleMaxH; // _900
	f32 mLookAtEyeAngleMinV; // _904
	f32 mLookAtEyeAngleMinInSightV; // _908
	f32 mLookAtEyeAngleMaxV; // _90C
	f32 mTiltEyeBorderStart; // _910
	f32 mTiltEyeBorderEnd; // _914
	f32 mTiltEyeAngleScale; // _918
	f32 mCenterTiltRateMax; // _91C
	f32 mNoseChildLocalOffset; // _920
	f32 mNoseStability; // _924
	f32 mNoseFriction; // _928
	f32 mNoseLimitDegree; // _92C
	f32 mMustacheChildLocalOffset; // _930
	f32 mMustacheStability; // _934
	f32 mMustacheFriction; // _938
	f32 mMustacheLimitDegree; // _93C
	s32 mCapInterpolateFrame; // _940
	f32 mCapChildLocalOffset; // _944
	f32 mCapStability; // _948
	f32 mCapFriction; // _94C
	f32 mCapLimitDegree; // _950
	f32 mCapTransStability; // _954
	f32 mCapTransFriction; // _958
	f32 mCapTransLimit; // _95C
	s32 mCapManHeroEyesWaitAppearFrame; // _960
	s32 mDeadWipeStartDamage; // _964
	s32 mDeadWipeWaitDamage; // _968
	s32 mDeadWipeStartAbyss; // _96C
	s32 mDeadWipeWaitAbyss; // _970
	s32 mDeadWipeStartAbyssWithCapMsg; // _974
	s32 mDeadWipeWaitAbyssWithCapMsg; // _978
	s32 mDeadWipeStartPress; // _97C
	s32 mDeadWipeWaitPress; // _980
	s32 mDeadWipeStartSandSink; // _984
	s32 mDeadWipeWaitSandSink; // _988
	s32 mDeadWipeStartNoOxygen; // _98C
	s32 mDeadWipeWaitNoOxygen; // _990
	s32 mDeadWipeStartIceWater; // _994
	s32 mDeadWipeWaitIceWater; // _998
	f32 mCoinDashSpeed; // _99C
	f32 mCoinDashSpeedLimit; // _9A0
	f32 mAdditionalSpeedLimit; // _9A4
};